AILIFE4798/Hoverboard-Firmware-Hack-Gen2.x-MM32/HoverBoardMindMotion/Src/autodetect.c
#include "mm32_device.h"                // Device header
#include "hal_gpio.h"
#include "hal_adc.h"
#include "hal_conf.h"
#include "hal_uid.h"
#include "../Inc/autodetect.h"
#include "../Inc/hardware.h"
#include "../Inc/initialize.h"
#include "../Inc/delay.h"
#include "../Inc/uart.h"
#include "../Inc/bldc.h"
#include "../Inc/sim_eeprom.h"
#include "../Inc/pinout.h"
#include "math.h"

extern MM32GPIO pins[PINCOUNT];
extern MM32ADC adcs[ADCCOUNT];
extern uint32_t millis;
modes_t mode=0;
uint8_t test;
int tmp;
uint8_t used(uint8_t pin);
uint32_t lastCommutation;
extern uint8_t step;
uint8_t init=0;
extern __IO u32 sTimingDelay;
extern u8 sRxBuffer[10];
uint16_t revolutions=0;
//uint8_t scan=0;
//uint8_t halltmp[3];
//uint8_t laststate[33];
//uint32_t lastchange[33];
uint8_t selpin=0;
uint8_t blinkstate=0;
uint32_t lastblink;
extern float vcc;
uint8_t adcleft[10];
uint8_t showalladc=0;
uint8_t detectall=0;
extern uint8_t masterslave;
extern u8 device_id_data[12];
uint8_t wait;
uint8_t doinloop=0;
extern uint8_t hallposprev;
extern bool dir;
int testrotatespeed;
uint8_t command;
uint8_t address;
uint16_t data;
uint8_t stage;
char addrstr[16];
char datastr[4];
uint8_t addrparsemode;
uint8_t dataparsemode;
uint8_t addrlen=0;
uint8_t datalen=0;


uint8_t hallA[PINCOUNT];
uint8_t hallB[PINCOUNT];
uint8_t hallC[PINCOUNT];
extern uint16_t pinstorage[64];    
//0:halla,1:hallb,2:hallc,3:ledr,4:ledg,5:ledb,6:ledup,7:leddown,8:buzzer,9:button,10:selfhold,11:charger,12:vbat,13:itotal,14:tx,15:rx,16:iphasea,17:iphaseb,18:iphasec,19~22:reserved,23:OCP,24:OCP ref,25:IR_L,26:IR_R,27:serial2tx,28:serial2rx,29~31:reserved,32:0XDCBA,33:vbat divider,34:itotal divider,35:iphase divider,36:baud,37:pwm resolution,38:slave ID,39:windings,40:invert lowside,41:soft current limit,42:hard limit awdg,43:UART,44:pid,45:bat 100%,46:bat0%,47:serial timeout,48~64:reserved 
uint16_t prevpinstorage[64];    

uint8_t banner[]={0X20,0X20,0X5F,0X20,0X20,0X20,0X5F,0X20,0X20,0X5F,0X5F,0X5F,0X5F,0X5F,0X20,0X20,0X20,0X20,0X20,0X5F,0X5F,0X5F,0X5F,0X5F,0X5F,0X5F,0X20,0X5F,0X5F,0X5F,0X5F,0X20,0X20,0X20,0X20,0X5F,0X20,0X20,0X20,0X5F,0X20,0X20,0X20,0X20,0X5F,0X20,0X20,0X20,0X20,0X5F,0X5F,0X5F,0X5F,0X20,0X5F,0X20,0X20,0X5F,0X5F,0X20,0X5F,0X5F,0X20,0X20,0X20,0X20,0X20,0X5F,0X5F,0X5F,0X5F,0X5F,0X5F,0X20,0X20,0X0A,0X0D,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X2F,0X20,0X5F,0X20,0X5C,0X20,0X5C,0X20,0X20,0X20,0X2F,0X20,0X2F,0X20,0X5F,0X5F,0X5F,0X5F,0X7C,0X20,0X20,0X5F,0X20,0X5C,0X20,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X20,0X20,0X2F,0X20,0X5C,0X20,0X20,0X2F,0X20,0X5F,0X5F,0X5F,0X7C,0X20,0X7C,0X2F,0X20,0X2F,0X20,0X5C,0X20,0X5C,0X20,0X20,0X20,0X2F,0X20,0X2F,0X5F,0X5F,0X5F,0X20,0X5C,0X20,0X0A,0X0D,0X20,0X7C,0X20,0X7C,0X5F,0X7C,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X20,0X5C,0X20,0X5C,0X20,0X2F,0X20,0X2F,0X7C,0X20,0X20,0X5F,0X7C,0X20,0X7C,0X20,0X7C,0X5F,0X29,0X20,0X7C,0X20,0X7C,0X20,0X7C,0X5F,0X7C,0X20,0X7C,0X20,0X2F,0X20,0X5F,0X20,0X5C,0X7C,0X20,0X7C,0X20,0X20,0X20,0X7C,0X20,0X27,0X20,0X2F,0X20,0X20,0X20,0X5C,0X20,0X5C,0X20,0X2F,0X20,0X2F,0X20,0X20,0X5F,0X5F,0X29,0X20,0X7C,0X0A,0X0D,0X20,0X7C,0X20,0X20,0X5F,0X20,0X20,0X7C,0X20,0X7C,0X5F,0X7C,0X20,0X7C,0X5C,0X20,0X56,0X20,0X2F,0X20,0X7C,0X20,0X7C,0X5F,0X5F,0X5F,0X7C,0X20,0X20,0X5F,0X20,0X3C,0X20,0X20,0X7C,0X20,0X20,0X5F,0X20,0X20,0X7C,0X2F,0X20,0X5F,0X5F,0X5F,0X20,0X5C,0X20,0X7C,0X5F,0X5F,0X5F,0X7C,0X20,0X2E,0X20,0X5C,0X20,0X20,0X20,0X20,0X5C,0X20,0X56,0X20,0X2F,0X20,0X20,0X2F,0X20,0X5F,0X5F,0X2F,0X20,0X0A,0X0D,0X20,0X7C,0X5F,0X7C,0X20,0X7C,0X5F,0X7C,0X5C,0X5F,0X5F,0X5F,0X2F,0X20,0X20,0X5C,0X5F,0X2F,0X20,0X20,0X7C,0X5F,0X5F,0X5F,0X5F,0X5F,0X7C,0X5F,0X7C,0X20,0X5C,0X5F,0X5C,0X20,0X7C,0X5F,0X7C,0X20,0X7C,0X5F,0X2F,0X5F,0X2F,0X20,0X20,0X20,0X5C,0X5F,0X5C,0X5F,0X5F,0X5F,0X5F,0X7C,0X5F,0X7C,0X5C,0X5F,0X5C,0X20,0X20,0X20,0X20,0X5C,0X5F,0X2F,0X20,0X20,0X7C,0X5F,0X5F,0X5F,0X5F,0X5F,0X7C,0X0A,0X0D,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X20,0X0A,0X0D,0X0A,0X0D};
char PXX[PINCOUNT][5]={"PA0\0","PA1\0","PA2\0","PA3\0","PA4\0","PA5\0","PA6\0","PA7\0","PA11\0","PA12\0","PA13\0","PA14\0","PA15\0","PB0\0","PB1\0","PB2\0","PB3\0","PB4\0","PB5\0","PB6\0","PB7\0","PB8\0","PB9\0","PB10\0","PB11\0","PB12\0","PC13\0","PC14\0","PC15\0","PD0\0","PD1\0","PD2\0","PD3\0"};
char addrdescription[64][14]={
{"halla\0"},
{"hallb\0"},
{"hallc\0"},
{"ledr\0"},
{"ledg\0"},
{"ledb\0"},
{"ledu\0"},
{"ledd\0"},
{"buzzer\0"},
{"button\0"},
{"latch\0"},
{"charge\0"},
{"vbat\0"},
{"itotal\0"},
{"tx\0"},
{"rx\0"},
{"iphasea\0"},
{"iphaseb\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"ocp\0"},
{"ocpref\0"},
{"irl\0"},
{"irr\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"magicnum\0"},
{"vbatdivider\0"},
{"itotaldivider\0"},
{"reserved\0"},
{"baud\0"},
{"pwmres\0"},
{"slaveid\0"},
{"windings\0"},
{"invlowside\0"},
{"softocp\0"},
{"hardocp\0"},
{"reserved\0"},
{"constspeed\0"},
{"batfull\0"},
{"batempty\0"},
{"timeout\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
{"reserved\0"},
};
	
void autoDetectInit();

void selfhold(){
	for(uint8_t i=0;i<PINCOUNT;i++){
		if(!used(i)){
			pinMode(i,INPUT_PULLUP);    //pull up insted of output high to protect micro controller
		}
	}
}

uint8_t detectSelfHold(){
	vref_Init();    //uses internal 1.2v refrence to detect vcc voltage
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
	DELAY_Ms(100);    //wait for adc stablize
	uint8_t havelatch=0;
	for(uint8_t i=0;i<PINCOUNT;i++){
		if(!used(i)){
			uint32_t timeout = millis+50;    //10ms not enough for capacitor to discharge
			uint32_t treshold = (uint16_t)ADC1->CH15DR+10;    //refrence is very stable, 10 is enough to detect change(0.05v drop)
			pinMode(i,INPUT);    //release latch
			while(1){
				tmp = (uint16_t)ADC1->CH15DR;
				if(tmp>treshold){
					pinMode(i,INPUT_PULLUP);    //set it back quickly
					LATCHPIN = i;    //save the pin
					havelatch=1;
					DELAY_Ms(10);    //capacitor charge back up
				}
				if(millis>timeout){    //wrong pin
					break;
				}
			}
	  }
	}	
	uint16_t adcval = ADC1->CH15DR;
	vcc=(double)4915.2/adcval;    //vcc saved to calculate accurate vbat
	return havelatch;
}
	
	
uint8_t used(uint8_t pin){
	for(uint8_t i=0;i<16;i++){
		if(pinstorage[i]==pin){
			return 1;    //pin already used
		}
	}
	return 0;
}
	
	
void autoDetectSerialIt(){    //serial dma interrupt
	switch (mode){
		case MODE_WAIT_UART :
			if(sRxBuffer[0]=='\n'||sRxBuffer[0]=='\r'){    //go to main menu after enter pressed
				mode=MODE_MENU;
				init=1;
				sTimingDelay=0;
			}
			break;
		case MODE_MENU :
			switch(sRxBuffer[0]){    //choose action in menu
				case '1':    //(1)-Auto detect all pins.
					mode=MODE_HALL;
					init=1;
					detectall=1;    //only exit to main menu after all step completed 
				break;
				case '2':    //(2)-Auto detect HALL sensor.
					mode=MODE_HALL;
					init=1;
					detectall=0;
					doinloop=1;
				break;
				case '3':    //(3)-Auto detect LED and buzzer.
					mode=MODE_LED;
					init=1;
					detectall=0;
				break;
				case '4':    //(4)-Auto detect battery voltage.
					mode=MODE_VBAT;
					init=1;
					detectall=0;
				break;
				case '5':    //(5)-Auto detect total current.
					UART_SendString("Feature not implemented.");
				break;
				case '6':    //(6)-Auto detect power button.
					if(masterslave){
						mode=MODE_BUTTON;
						init=1;
						detectall=0;
					}else{
						UART_SendString("I'm a Slave board.");
					}
				break;
				case '7':    //(7)-Modify configurations manually by command line.
					mode=MODE_CLI;
					init=1;
					detectall=0;
				break;
				case '8':    //(8)-Test motor rotation.
					mode=MODE_TESTROTATE;
					init=1;
					detectall=0;
				break;
				case '9':    //(9)-Power off.
					if(masterslave){
						UART_SendString("Thanks for choosing my firmware,goodbye.");
						pinMode(LATCHPIN,INPUT);
					}else{
						UART_SendString("I'm a Slave board.");
					}
				break;
				
