AILIFE4798/Hoverboard-Firmware-Hack-Gen2.x-MM32/HoverBoardMindMotion/Src/autodetect.c
		}
		for(uint8_t i=0;i<PINCOUNT;i++){    //everything is possible
			hallA[i] = 1;
			hallB[i] = 1;
			hallC[i] = 1;
		}
		for(uint8_t i=0;i<PINCOUNT;i++){    //remove used pins from possible pins
			if(used(i)){
				hallA[i]=0;
				hallB[i]=0;
				hallC[i]=0;
			}
		}
	}
	TIM1->CCR1=0;    //disable motor after all pins is found
	TIM1->CCR2=0;
	TIM1->CCR3=0;
	if(doinloop){
		UART_SendString("\r\nDetection sucessful");
		doinloop=0;
	}
}	


/*
void simhallupdate(){    //does not work : (
	for(uint8_t i=0;i<33;i++){
		if(!used(i)){
			laststate[i]=digitalRead(pins[i][0],pins[i][1]);
		}
	}
	while(halltmp[2]==255){
		uint8_t tmpindex=0;
		for(uint8_t i=0;i<33;i++){
			if(millis-lastCommutation>30){
				step++;
				if(step>6){
					step=1;
					revolutions++;
				}
				commutate();
				lastCommutation=millis;
			}
			if(!used(i)){
				TIM_CtrlPWMOutputs(TIM1, DISABLE);
				if(laststate[i]!=digitalRead(pins[i][0],pins[i][1])){
					TIM_CtrlPWMOutputs(TIM1, ENABLE);
					char buffer[16];
					uint32_t halltime=millis-lastchange[i];
					sprintf(&buffer,"\nhalltime:%i",halltime);
					UART_Send_Group(&buffer[0],16);
					if(halltime>20&&halltime<100){
						pinstorage[tmpindex] = halltmp[tmpindex] = i;
						tmpindex++;
						UART_Send_Group(&PXX[i][0],4);
					}
					lastchange[i]=millis;
				}
				TIM_CtrlPWMOutputs(TIM1, ENABLE);
				DELAY_Ms(1);
			}
		}
	}
}
*/

void autoDetectInit(){
	switch (mode){
		case MODE_MENU :
			GetChipUID();
			UART_SendString("\n\n\n\n\r");
			UART_Send_Group(&banner[0],464);
			UART_SendString("Board type:");
			UART_SendString(masterslave?"Master":"Slave");
			char buffer[80];
			sprintf(&buffer[0],"  MCU Voltage:%fV  Serial number:%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X\n\r",vcc,device_id_data[0],device_id_data[1],device_id_data[2],device_id_data[3],device_id_data[4],device_id_data[5],device_id_data[6],device_id_data[7],device_id_data[8],device_id_data[9],device_id_data[10],device_id_data[11]);
			UART_SendString(&buffer[0]);
			UART_SendString("Welcome to PinFinder, press number key to choose action.\n\r");
			UART_SendString("  (1)-Auto detect all pins.\n\r");
			UART_SendString("  (2)-Auto detect HALL sensor.\n\r");
			UART_SendString("  (3)-Auto detect LED and buzzer.\n\r");
			UART_SendString("  (4)-Auto detect battery voltage.\n\r");
			UART_SendString("  (5)-Auto detect total current.\n\r");
			UART_SendString("  (6)-Auto detect power button.\n\r");
			UART_SendString("  (7)-Modify configurations manually by command line.\n\r");
			UART_SendString("  (8)-Test motor rotation.\n\r");
			UART_SendString("  (9)-Power off.\n\r>");
			for(uint8_t i=0;i<64;i++){
				prevpinstorage[i]=pinstorage[i];
			}
		break;
		case MODE_HALL :
			UART_SendString("\n\rthis will spin motor slowly to detect hall sensor pins,if it takes too long please increase input voltage to 42v.\n\rpress Y to start,Enter to return to menu\n\r");
			wait=1;
			while(wait){
				__NOP();
				__NOP();
			}
			if(mode==MODE_HALL){
				TIM_CtrlPWMOutputs(TIM1, ENABLE);
				TIM1->CCR1=4000;    //spin motor at 50% pwm
				TIM1->CCR2=4000;
				TIM1->CCR3=4000;
				for(uint8_t i=0;i<PINCOUNT;i++){
					hallA[i] = 1;
					hallB[i] = 1;
					hallC[i] = 1;
				}
				for(uint8_t i=0;i<PINCOUNT;i++){    //remove used pins from hall array
					if(used(i)){
						hallA[i]=0;
						hallB[i]=0;
						hallC[i]=0;
					}
				}
				pinstorage[0]=pinstorage[1]=pinstorage[2]=255;
			/*
				halltmp[0]=halltmp[1]=halltmp[2]=255;
				revolutions=0;
			*/
			}
		break;
		case MODE_LED :
			UART_SendString("\n\rAll pins will be set high, the selected pin will blink, the already saved pins will remain off. If a LED does not light up, it is broken.\r\npress W to go to next pin\r\npress S to go to previous pin\n\rPress R to save as red LED\r\nPress G to save as green LED\r\nPress B to save as blue LED(or orange on some board)\r\nPress U to save as upper LED\r\nPress L to save as lower LED\r\npress Enter to go back to main menu\r\n");
			for(uint8_t i=0;i<PINCOUNT;i++){
				if(!used(i)){
					pinMode(i,INPUT_PULLUP);
				}
			}
			selpin=0;
			while(used(selpin)){    //find the first unused pin to start
				selpin++;
			}
		break;
		case MODE_VBAT :
			UART_SendString("\r\nA list of pin and voltage will be displayed, check the board input voltage with multimeter and select the closest one.\r\npress F to toggle automatic pin filtering\r\npress the number at the front of pin to save it\r\npress enter to return to main menu\r\n");
			TIM_CtrlPWMOutputs(TIM1, ENABLE);
			TIM1->CCR1=8192;
			TIM1->CCR2=8192;
			TIM1->CCR3=8192;
			step=0;    //close all low side mosfet to prevent reading phase current
			commutate();
			ADCALL_Init();    //enable every adc pins to be scanned at same time
			for(uint8_t i=0;i<ADCCOUNT;i++){
				if(!used(adcs[i].io)){    //coresponding gpio is free
					ADC_RegularChannelConfig(ADC1, adcs[i].channel, 0, ADC_SampleTime_7_5Cycles);
					pinMode(adcs[i].io,INPUT_ADC);
					adcleft[i]=1;
				}else{
					adcleft[i]=0;
				}
			}
			ADC_SoftwareStartConvCmd(ADC1, ENABLE);    //enable adc
		break;
		case MODE_BUTTON :
			UART_SendString("\r\nPress and release power button once to detect automaticly\r\nIf button press is not registered,press E to enable fix, the board may acidently power off\r\npress Enter to return to main menu\r\n");
			for(uint8_t i=0;i<PINCOUNT;i++){
				if(!used(i)){
					hallA[i]=digitalRead(i);    //hall array reused to detect change in io state for button
				}
			}
		break;
		case MODE_CLI :
			UART_SendString("\r\nWelcome to command line interface,type h for help\n\rpinfinder~$ ");
			command=0;    //initialize command
			address=0;
			data=0;
			stage=0;
		break;
		case MODE_TESTROTATE :
			UART_SendString("\r\nTest the motor with hall sensor commutation\r\npress + to increase speed\r\npress - to decrease speed\r\nnegative speed to spin backward\r\npress Enter to return to main menu\n\n\r");
			TIM_CtrlPWMOutputs(TIM1, ENABLE);
			TIM1->CCR1=0; 
			TIM1->CCR2=0;
			TIM1->CCR3=0;
			testrotatespeed=0;
			pinMode(HALLAPIN,INPUT);    //hall sensor floating input
			pinMode(HALLBPIN,INPUT);
			pinMode(HALLCPIN,INPUT);
		break;
		case MODE_SAVE :
			UART_SendString("\r\nChanges were made to the configurations, do you want to save it permanantly?Y/N\r\n>");
		break;
	}		
}
	
void blinkLEDupdate(){
	if(millis-lastblink>200){
		pinMode(selpin,blinkstate ? INPUT : INPUT_PULLUP);    //toggle pullup pulldown to blink
		blinkstate=!blinkstate;
		lastblink=millis;
	}
	
